[
    {
    "id": 1,
    "title": "JavaScript basics",
    "price": 109,
    "description": "JavaScript is a programming language that adds interactivity to your website. This happens in games, in the behavior of responses when buttons are pressed or with data entry on forms; with dynamic styling; with animation, etc. This article helps you get started with JavaScript and furthers your understanding of what is possible.JavaScript itself is relatively compact, yet very flexible. Developers have written a variety of tools on top of the core JavaScript language, unlocking a vast amount of functionality with minimum effort. These include:",
    "category": "Basics js",
    "image": "https://www.androidauthority.com/wp-content/uploads/2015/12/javascript.jpg"
    },
    {
    "id": 2,
    "title": "Template literals",
    "price": 22,
    "description": "Template literals are sometimes informally called template strings, because they are used most commonly for string interpolation (to create strings by doing substitution of placeholders). However, a tagged template literal may not result in a string; it can be used with a custom tag function to perform whatever operations you want on the different parts of the template literal.",
    "category": "ES6 js",
    "image": "https://miro.medium.com/max/1200/1*rzRvCAZeIHhCbqzTaRJ88A.jpeg"
    },
    {
    "id": 3,
    "title": "JS Arrrow Function",
    "price": 20,
    "description": "JavaScript arrow functions are also called Fat arrow functions. These were introduced in ES6. Their concise syntax and handling of the this keyword has made JavaScript arrow functions an ES6 favourite among developers.",
    "category": "ES6 JS",
    "image": "https://azpanel.azilen.com/uploads/HOW_AN_1_0adedb20b7.jpg"
    },
    {
    "id": 4,
    "title": "Spread Operator in Javascript",
    "price": 15,
    "description": "Hey everyone, in today's article we'll look at the Spread Operator in Javascript. It originally appeared in ES6 (Javascript upgrade from 2015). It is identical to the rest operator only in syntax. Remember to bookmark this page so you can come back to it later. Meaning: The Spread Operator expands or spreads all of the elements in an array syntex: (...arrayName)",
    "category": "ES6 JS",
    "image": "https://miro.medium.com/max/1400/1*FF6k1dTEHLnuLWpkRx0dHw.png"
    },
    {
    "id": 5,
    "title": "Local Storage and Session Storage",
    "price": 65,
    "description": "Now let’s see the situations where it would make sense to use local storage. Since local storage exists until explicitly deleted, you can use it for data you want to store long term, even after the user has closed the tab or browser. Since session storage is only valid for one tab, you would use it when you want to store data that should not be accessible from other tabs.",
    "category": "Advance js",
    "image": "https://isamatov.com/images/local-storage-vs-session-storage/local-storage-vs-session-storage.png"
    },
    {
    "id": 6,
    "title": "Ternary operator ",
    "price": 18,
    "description": "One limitation to this technique compared to the else-if sequence is that there can’t be more that one statement for each conditional. If you need to do two things, or instantiate an intermediary variable, the whole thing must replaced by a classical else-if sequence. Unless you take the statements out into a separate function.",
    "category": "advance js",
    "image": "https://www.fluentcpp.com/wp-content/uploads/2017/07/ternary-operator.jpg"
    },
    {
    "id": 7,
    "title": "Arrrow Methods Map() ES6",
    "price": 9,
    "description": "In JavaScript ES6, we use the map() helper when we want to modify a list of data. When map() is finished running, it creates and populates a new array with the results.In ES5, we would need to use a for loop to iterate over the array and push the results to a previously created empty array.",
    "category": "ES6 js",
    "image": "https://824916.smushcdn.com/1628947/wp-content/uploads/2020/04/js-banner-map.jpg?lossy=1&strip=1&webp=1"
    },
    {
    "id": 8,
    "title": "ECMAScript Course (ES6)",
    "price": 99,
    "description": "ECMAScript 2015 or ES2015 is a significant update to the JavaScript programming language. It is the first major update to the language since ES5 which was standardized in 2009. Therefore, ES2015 is often called ES6. To follow this ES6 tutorial, you should have a good knowledge of JavaScript up to ES5. Let, Const terney operator, map,fillter,find, destructuring etc.",
    "category": "ES6",
    "image": "https://miro.medium.com/max/786/1*PRWUR9YdS1jWOP7Al3qPEA.jpeg"
    },
    {
    "id": 9,
    "title": "Arrow Methods forEach() ES6",
    "price": 22,
    "description": "The ES5 for loop works fine. It will go through each item in an array and console log it but if an error occurs it can be challenging to see what’s going wrong, especially if there is lots of logic to follow. ES6 introduces the forEach() helper which can replace the for loop. But why bother doing it a different way? Well, I find the for loop has some disadvantages.",
    "category": "ES6 js",
    "image": "https://824916.smushcdn.com/1628947/wp-content/uploads/2020/03/js-banner-forEach.jpg?lossy=1&strip=1&webp=1"
    }
]