[
    {
    "id": 1,
    "title": "JavaScript basics",
    "price": 109,
    "description": "JavaScript is a programming language that adds interactivity to your website. This happens in games, in the behavior of responses when buttons are pressed or with data entry on forms; with dynamic styling; with animation, etc. This article helps you get started with JavaScript and furthers your understanding of what is possible.JavaScript itself is relatively compact, yet very flexible. Developers have written a variety of tools on top of the core JavaScript language, unlocking a vast amount of functionality with minimum effort. These include:",
    "category": "Basics js",
    "image": "https://www.androidauthority.com/wp-content/uploads/2015/12/javascript.jpg"
    },
    {
    "id": 2,
    "title": "Template literals",
    "price": 22,
    "description": "Template literals are sometimes informally called template strings, because they are used most commonly for string interpolation (to create strings by doing substitution of placeholders). However, a tagged template literal may not result in a string; it can be used with a custom tag function to perform whatever operations you want on the different parts of the template literal.",
    "category": "ES6 js",
    "image": "https://miro.medium.com/max/1200/1*rzRvCAZeIHhCbqzTaRJ88A.jpeg"
    },
    {
    "id": 3,
    "title": "JS Arrrow Function",
    "price": 20,
    "description": "JavaScript arrow functions are also called Fat arrow functions. These were introduced in ES6. Their concise syntax and handling of the this keyword has made JavaScript arrow functions an ES6 favourite among developers.",
    "category": "ES6 JS",
    "image": "https://azpanel.azilen.com/uploads/HOW_AN_1_0adedb20b7.jpg"
    },
    {
    "id": 4,
    "title": "Spread Operator in Javascript",
    "price": 15,
    "description": "Hey everyone, in today's article we'll look at the Spread Operator in Javascript. It originally appeared in ES6 (Javascript upgrade from 2015). It is identical to the rest operator only in syntax. Remember to bookmark this page so you can come back to it later. Meaning: The Spread Operator expands or spreads all of the elements in an array syntex: (...arrayName)",
    "category": "ES6 JS",
    "image": "https://miro.medium.com/max/1400/1*FF6k1dTEHLnuLWpkRx0dHw.png"
    },
    {
    "id": 5,
    "title": "Local Storage and Session Storage",
    "price": 65,
    "description": "Now let’s see the situations where it would make sense to use local storage. Since local storage exists until explicitly deleted, you can use it for data you want to store long term, even after the user has closed the tab or browser. Since session storage is only valid for one tab, you would use it when you want to store data that should not be accessible from other tabs.",
    "category": "Advance js",
    "image": "https://isamatov.com/images/local-storage-vs-session-storage/local-storage-vs-session-storage.png"
    },
    {
    "id": 6,
    "title": "Solid Gold Petite Micropave ",
    "price": 168,
    "description": "Satisfaction Guaranteed. Return or exchange any order within 30 days.Designed and sold by Hafeez Center in the United States. Satisfaction Guaranteed. Return or exchange any order within 30 days.",
    "category": "jewelery",
    "image": "https://fakestoreapi.com/img/61sbMiUnoGL._AC_UL640_QL65_ML3_.jpg"
    },
    {
    "id": 7,
    "title": "White Gold Plated Princess",
    "price": 9.99,
    "description": "Classic Created Wedding Engagement Solitaire Diamond Promise Ring for Her. Gifts to spoil your love more for Engagement, Wedding, Anniversary, Valentine's Day...",
    "category": "jewelery",
    "image": "https://fakestoreapi.com/img/71YAIFU48IL._AC_UL640_QL65_ML3_.jpg"
    },
    {
    "id": 8,
    "title": "Pierced Owl Rose Gold Plated Stainless Steel Double",
    "price": 10.99,
    "description": "Rose Gold Plated Double Flared Tunnel Plug Earrings. Made of 316L Stainless Steel",
    "category": "jewelery",
    "image": "https://fakestoreapi.com/img/51UDEzMJVpL._AC_UL640_QL65_ML3_.jpg"
    },
    {
    "id": 9,
    "title": "WD 2TB Elements Portable External Hard Drive - USB 3.0 ",
    "price": 64,
    "description": "USB 3.0 and USB 2.0 Compatibility Fast data transfers Improve PC Performance High Capacity; Compatibility Formatted NTFS for Windows 10, Windows 8.1, Windows 7; Reformatting may be required for other operating systems; Compatibility may vary depending on user’s hardware configuration and operating system",
    "category": "electronics",
    "image": "https://fakestoreapi.com/img/61IBBVJvSDL._AC_SY879_.jpg"
    },
    {
    "id": 10,
    "title": "SanDisk SSD PLUS 1TB Internal SSD - SATA III 6 Gb/s",
    "price": 109,
    "description": "Easy upgrade for faster boot up, shutdown, application load and response (As compared to 5400 RPM SATA 2.5” hard drive; Based on published specifications and internal benchmarking tests using PCMark vantage scores) Boosts burst write performance, making it ideal for typical PC workloads The perfect balance of performance and reliability Read/write speeds of up to 535MB/s/450MB/s (Based on internal testing; Performance may vary depending upon drive capacity, host device, OS and application.)",
    "category": "electronics",
    "image": "https://fakestoreapi.com/img/61U7T1koQqL._AC_SX679_.jpg"
    }
]